; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_76)

(:domain logistics)

(:objects
	obj0 obj2 obj4 obj10 - airport
	obj1 obj3 obj5 obj11 - city
	obj6 obj12 obj14 obj15 obj18 obj19 obj20 obj21 obj22 obj23 - package
	obj7 obj8 obj9 obj13 - truck
	obj16 obj17 - airplane
)

(:init
	(at obj6 obj4)
	(at obj7 obj0)
	(at obj8 obj4)
	(at obj9 obj2)
	(at obj12 obj0)
	(at obj13 obj10)
	(at obj14 obj2)
	(at obj15 obj10)
	(at obj16 obj4)
	(at obj17 obj10)
	(at obj18 obj2)
	(at obj19 obj4)
	(at obj20 obj0)
	(at obj21 obj4)
	(at obj22 obj2)
	(at obj23 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj4 obj5)
	(in-city obj10 obj11)
)

(:goal (and
	(at obj6 obj10)
	(at obj12 obj2)
	(at obj14 obj0)
	(at obj15 obj2)
	(at obj18 obj4)
	(at obj19 obj0)
	(at obj20 obj2)
	(at obj21 obj10)
	(at obj22 obj0)
	(at obj23 obj0)
))
)

; plan
1. (load obj16 obj19 obj4)
   deleted: (at obj19 obj4)
   added: (in obj19 obj16)
   goals met: 0 of 10
2. (load obj16 obj21 obj4)
   deleted: (at obj21 obj4)
   added: (in obj21 obj16)
   goals met: 0 of 10
3. (load obj16 obj6 obj4)
   deleted: (at obj6 obj4)
   added: (in obj6 obj16)
   goals met: 0 of 10
4. (load obj17 obj15 obj10)
   deleted: (at obj15 obj10)
   added: (in obj15 obj17)
   goals met: 0 of 10
5. (fly obj16 obj4 obj0)
   deleted: (at obj16 obj4)
   added: (at obj16 obj0)
   goals met: 0 of 10
6. (fly obj17 obj10 obj2)
   deleted: (at obj17 obj10)
   added: (at obj17 obj2)
   goals met: 0 of 10
7. (load obj16 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj16)
   goals met: 0 of 10
8. (load obj16 obj20 obj0)
   deleted: (at obj20 obj0)
   added: (in obj20 obj16)
   goals met: 0 of 10
9. (load obj17 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj17)
   goals met: 0 of 10
10. (load obj17 obj18 obj2)
   deleted: (at obj18 obj2)
   added: (in obj18 obj17)
   goals met: 0 of 10
11. (load obj17 obj22 obj2)
   deleted: (at obj22 obj2)
   added: (in obj22 obj17)
   goals met: 0 of 10
12. (load obj17 obj23 obj2)
   deleted: (at obj23 obj2)
   added: (in obj23 obj17)
   goals met: 0 of 10
13. (unload obj16 obj19 obj0)
   deleted: (in obj19 obj16)
   added: (at obj19 obj0)
   goals met: 1 of 10
14. (unload obj17 obj15 obj2)
   deleted: (in obj15 obj17)
   added: (at obj15 obj2)
   goals met: 2 of 10
15. (fly obj16 obj0 obj10)
   deleted: (at obj16 obj0)
   added: (at obj16 obj10)
   goals met: 2 of 10
16. (fly obj17 obj2 obj0)
   deleted: (at obj17 obj2)
   added: (at obj17 obj0)
   goals met: 2 of 10
17. (load obj7 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj7)
   goals met: 1 of 10
18. (load obj9 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj9)
   goals met: 0 of 10
19. (unload obj16 obj21 obj10)
   deleted: (in obj21 obj16)
   added: (at obj21 obj10)
   goals met: 1 of 10
20. (unload obj16 obj6 obj10)
   deleted: (in obj6 obj16)
   added: (at obj6 obj10)
   goals met: 2 of 10
21. (unload obj17 obj14 obj0)
   deleted: (in obj14 obj17)
   added: (at obj14 obj0)
   goals met: 3 of 10
22. (unload obj17 obj22 obj0)
   deleted: (in obj22 obj17)
   added: (at obj22 obj0)
   goals met: 4 of 10
23. (unload obj17 obj23 obj0)
   deleted: (in obj23 obj17)
   added: (at obj23 obj0)
   goals met: 5 of 10
24. (fly obj16 obj10 obj2)
   deleted: (at obj16 obj10)
   added: (at obj16 obj2)
   goals met: 5 of 10
25. (fly obj17 obj0 obj4)
   deleted: (at obj17 obj0)
   added: (at obj17 obj4)
   goals met: 5 of 10
26. (unload obj16 obj12 obj2)
   deleted: (in obj12 obj16)
   added: (at obj12 obj2)
   goals met: 6 of 10
27. (unload obj16 obj20 obj2)
   deleted: (in obj20 obj16)
   added: (at obj20 obj2)
   goals met: 7 of 10
28. (unload obj17 obj18 obj4)
   deleted: (in obj18 obj17)
   added: (at obj18 obj4)
   goals met: 8 of 10
29. (unload obj7 obj19 obj0)
   deleted: (in obj19 obj7)
   added: (at obj19 obj0)
   goals met: 9 of 10
30. (unload obj9 obj15 obj2)
   deleted: (in obj15 obj9)
   added: (at obj15 obj2)
   goals met: 10 of 10
